"(Not You?)|Login - Clickable text letting user log in as a different user" = "(Not You?)";

"+%i|Very short string used in place of X names of members of a thread (when the thread name is too long to fit). Ex: +1, +2, +3.  If the language has no short way to express this, use … (ellipsis) or equivalent." = "+%1$i";

",|Punctuation (comma) used to separate entries in a list of names. Example: Alice, Bob, Carol" = ",";

"1 Friend is Nearby|Title of megaphone to encourage user to share location." = "1 Friend is Nearby";

"1 day|text to show user was online/active 1 day ago (don't abbrev)" = "1 day";

"1 hour|text to show user was online/active 1 hour ago (don't abbrev)" = "1 hour";

"1 minute|text to show user was online/active 1 minute ago (don't abbrev)" = "1 minute";

"1d|short indicator that a user was active 1 day ago" = "1d";

"1h|short indicator that a user was active 1 hour ago" = "1h";

"1m Limit: Release to send|notify user that the maximum recording time has been reached" = "1m Limit: Release to send";

"1m|short indicator that a user was active 1 minute ago" = "1m";

"2 days|text to show user was online/active 2 days ago (don't abbrev)" = "2 days";

"2 hours|text to show user was online/active 2 hours ago (don't abbrev)" = "2 hours";

"2 minutes|text to show user was online/active 2 minutes ago (don't abbrev)" = "2 minutes";

"A new version of Messenger is available.|New version title" = "A new version of Messenger is available.";

"Activation Code|placeholder text for activation code field" = "Activation Code";

"Activation Request Failed|" = "Activation Request Failed";

"Active Now (%d)|Title for chat bar section containing online friends who are not top friends. Number after string is number of friends who are online." = "Active Now (%1$d)";

"Add Favorite|Title of screen shown when user is adding a new favorite" = "Add Favorite";

"Add More People|button for adding people to the conversation" = "Add More People";

"Add More People|title for add members page" = "Add More People";

"Add More People|title for add people page" = "Add More People";

"Add To Conversation|text to show in the add people button" = "Add To Conversation";

"Add to Existing Contact|action sheet option for adding a phone number to an existing contact" = "Add to Existing Contact";

"Add|generic add button" = "Add";

"Adding...|adding progress text" = "Adding...";

"Advanced Settings|text for advanced settings button" = "Advanced Settings";

"Advanced|title for advanced settings page" = "Advanced";

"Alerts Off Until %@|Indicates that alerts are off until X time" = "Alerts Off Until %1$@";

"Alerts Off for 1 Hour|Indicates that alerts are off for 1 hour" = "Alerts Off for 1 Hour";

"Alerts Off|Indicates that alerts are off" = "Alerts Off";

"Alerts On|Indicates that alerts are on" = "Alerts On";

"All notifications are off for 8h.|footer text for notifications settings applying to all conversations" = "All notifications are off for 8h.";

"All notifications are off.|Mute warning display on thread list" = "All notifications are off.";

"Answer|Text for button that accepts a call" = "Answer";

"Archive Thread|Button label that will archive the thread" = "Archive Thread";

"Are you sure you want to delete the conversation name?|alert message for deleting conversation name" = "Are you sure you want to delete the conversation name?";

"Are you sure you want to leave this conversation? You will no longer receive new messages.|confirmation dialog message for leaving a thread" = "Are you sure you want to leave this conversation? You will no longer receive new messages.";

"Are you sure?|Title for dialog asking the user if they're sure if they want to not enable push notifications" = "Are you sure?";

"Attach a Photo|Button label for attaching a photo from the photo library" = "Attach a Photo";

"Attach media|Accessibility text for button that lets user start attaching photos or other media, as well as emoticons and emoji" = "Attach media";

"Auto Send|Auto send label" = "Auto Send";

"Back|generic nav bar back button" = "Back";

"Bing Image Search|" = "Bing Image Search";

"Call Ended|End call message in non-error case" = "Call Ended";

"Call Ended|String shown when the call ends" = "Call Ended";

"Call Failed|End call message in error case" = "Call Failed";

"Call %@|action sheet option for calling a phone number" = "Call %1$@";

"Camera|Button label for attaching a photo from the camera" = "Camera";

"Cancel|Title for generic Cancel button." = "Cancel";

"Choose Photo|action sheet option for choosing a photo from photo library" = "Choose Photo";

"Clear|prompt to clear all unsent messages" = "Clear";

"Clearing...|Progress text shown while clearing the image for a thread" = "Clearing...";

"Clearing...|Progress text shown while clearing the name for a thread" = "Clearing...";

"Close active chat|Button to close an active chat" = "Close active chat";

"Comment|Comment button title" = "Comment";

"Compose message to %@|Accessibility label describing a text view to start writing a message to a user with no draft message" = "Compose message to %1$@";

"Compose message to %@: %@|Accessibility label describing a text view to start writing a message to a user with some appended draft message" = "Compose message to %1$@: %2$@";

"Confirm Phone|Title of page where user enters their phone number" = "Confirm Phone";

"Connecting|Text shown on call screen while connecting a call" = "Connecting";

"Connection Failed|Alert title when connection failed" = "Connection Failed";

"Connection Lost|End call message in connection lost case" = "Connection Lost";

"Contact Info|Title of the canonical thread info page." = "Contact Info";

"Contacting|Text shown on call screen while contacting another party" = "Contacting";

"Continue|Login - Login Button Title for Keychain Login" = "Continue";

"Conversation Name|placeholder text in conversation name textfield" = "Conversation Name";

"Copy Link|Option that pops out after long press on a link in message thread." = "Copy Link";

"Copy|action sheet option for copying a string to the clipboard" = "Copy";

"Could not add new members. Please try again.|message for failing to add members dialog" = "Could not add new members. Please try again.";

"Could not retrieve availability|Text shown to an user when the operation to retrieve the other party's callable status fails" = "Could not retrieve availability";

"Countries|Title for country picker" = "Countries";

"Country|Country - Country placeholder text" = "Country";

"Create Group Conversation|button for adding people to the canonical conversation" = "Create Group Conversation";

"Create New Contact|action sheet option for creating a new contact" = "Create New Contact";

"Currently in a call|Error message when user tries to initiate a call while already in a call" = "Currently in a call";

"Customize Notification Settings|User education for how to configure conversation alerts" = "Customize Notification Settings";

"Decline|Text for button that declines a call" = "Decline";

"Delete Conversation Name|alert title for deleting conversation name" = "Delete Conversation Name";

"Delete Message? It cannot be undone.|text shown when a user swipes to delete a message" = "Delete Message? It cannot be undone.";

"Delete|Button to accept deleting the name of a conversation" = "Delete";

"Delete|Label for button to delete previous character" = "Delete";

"Delete|button text for deleting a message" = "Delete";

"Delete|button text for removing an unsent message" = "Delete";

"Details|title for message details page" = "Details";

"Discover Who's Nearby|Title of NUX to encourage user to share location." = "Discover Who's Nearby";

"Discover which friends are nearby and let them know you're around.|Description of megaphone to encourage user to share location." = "Discover which friends are nearby and let them know you're around.";

"Discover who's in the area and let them know you're around.|Description of megaphone to encourage user to share location." = "Discover who's in the area and let them know you're around.";

"Dismiss|Dismiss the audio recorder" = "Dismiss";

"Don't Delete|Button to decline to delete the name of a conversation" = "Don't Delete";

"Don't Save|Don't save action sheet button" = "Don't Save";

"Done|Title for generic Done button that dismisses a view. This needs to be a short string to avoid truncation." = "Done";

"Download|Button title to download an upgrade" = "Download";

"Edit|Edit button/label title for chat divebar" = "Edit";

"Email|email field placeholder on login screen" = "Email";

"Empty Feedback|Title for empty feedback warning." = "Empty Feedback";

"Enter Code|Enter Code page title" = "Enter Code";

"Error|error title after failed to load webview" = "Error";

"Facebook User|Placeholder name for Facebook user whose name is unknown" = "Facebook User";

"Failed to add members|title for failing to add members dialog" = "Failed to add members";

"Failed to save your settings.|error message after changing thread alert setting." = "Failed to save your settings.";

"Favorites|chat bar favorites header title" = "Favorites";

"Free Call|Text on button that starts a messenger call" = "Free Call";

"Free Calling Unavailable|Title for dialog explaining that messenger calls are not available" = "Free Calling Unavailable";

"Friends of Friends|Table section header for a list of friends of friends search results" = "Friends of Friends";

"Friends on Messenger|Table title: Friends who have Facebook Messenger" = "Friends on Messenger";

"Get Directions|action sheet option for viewing a map" = "Get Directions";

"Get Facebook Messenger|Title of a link that takes the user to download the Facebook Messenger app" = "Get Facebook Messenger";

"Get Started|Title for NUX" = "Get Started";

"Give us feedback or report a problem|Placeholder text for the report bug or feedback input field" = "Give us feedback or report a problem";

"Google Image Search|" = "Google Image Search";

"Group Conversation|Create a group conversation divebar label" = "Group Conversation";

"Group Conversation|Label at top of online friends list that takes user to new message composer" = "Group Conversation";

"Group Info|Title of group thread info page." = "Group Info";

"Help|text for help button" = "Help";

"Hold to Talk|The instruction for holding the record button and talk" = "Hold to Talk";

"I'm sure|Button label confirming the user wants to continue with the selected action" = "I'm sure";

"If you enjoy using %@, would you mind taking a moment to rate this update? Thanks!|Prompt for user to rate the app." = "If you enjoy using %1$@, would you mind taking a moment to rate this update? Thanks!";

"Image Search|action sheet option for choosing a photo from image search" = "Image Search";

"Include your location|Title of location NUX when user has not yet made a choice regarding enabling or disabling location services." = "Include your location";

"Incomplete contact|Alert title: Newly created contact needs more information" = "Incomplete contact";

"Incorrect Confirmation Code.|alert title for incorrect confirmation code" = "Incorrect Confirmation Code.";

"Install Facebook Messenger?|The caption to promote users for installing Facebook Messenger app" = "Install Facebook Messenger?";

"Install Messenger to listen to this message and record your own.|The detailed message to tell user that the audio clip feature is not supported on the wilde, and then promote a link for them to download the Facebook Messenger app" = "Install Messenger to listen to this message and record your own.";

"Install|Button text to install the Facebook Messenger" = "Install";

"Invalid Contact|Alert title: Newly created contact has invalid information" = "Invalid Contact";

"Invalid Country Code|alert title for invalid country code" = "Invalid Country Code";

"Invalid Phone Number|alert title for invalid phone number" = "Invalid Phone Number";

"Keep everyone in the loop|Detail subtitle for Group Chat NUX slide" = "Keep everyone in the loop";

"Last Updated: %@|last updated date in pull to refresh header" = "Last Updated: %1$@";

"Learn More|Title for button to learn more about sharing location." = "Learn More";

"Leave Conversation|leave conversation button" = "Leave Conversation";

"Leave conversation?|confirmation dialog title for leaving a thread" = "Leave conversation?";

"Leave|Button title for leaving a thread" = "Leave";

"Leaving...|Progress text shown while leaving a thread" = "Leaving...";

"Let people in this conversation know where you are.|Text of location NUX when user has not yet made a choice regarding enabling or disabling location services." = "Let people in this conversation know where you are.";

"Licenses|Licenses screen title" = "Licenses";

"Licenses|text for licenses button" = "Licenses";

"Like|Like button title" = "Like";

"Load Earlier Messages|message for loading earlier messages" = "Load Earlier Messages";

"Loading...|Message presented while waiting for content to load." = "Loading...";

"Locating You...|Message presented when waiting for an accurate location fix." = "Locating You...";

"Location is Disabled|Title for dialog indicating that the app hasn't been granted location permissions" = "Location is Disabled";

"Location is off for this conversation|Title of location NUX when user turns off location services for the first time." = "Location is off for this conversation";

"Location services are off. Turn on to let people in this conversation know where you are.|Text of location NUX when user has disabled location services." = "Location services are off. Turn on to let people in this conversation know where you are.";

"Location services are on|Title of location NUX when user has enabled location services." = "Location services are on";

"Log In to Facebook|Login - Login Button Title for password login" = "Log In to Facebook";

"Logged in as %@|Login - Text showing who user is logged in as" = "Logged in as %1$@";

"Login Approval Required|title of login approval dialog" = "Login Approval Required";

"Login Failed|Invalid login alert title" = "Login Failed";

"Map|title of map tab" = "Map";

"Mark as Unread|Button label that will mark the thread as unread" = "Mark as Unread";

"Meet Friends on the Go|Title of megaphone to encourage user to share location." = "Meet Friends on the Go";

"Message|divebar message button title" = "Message";

"Messages|Messenger module display name" = "Messages";

"Messages|name of the app with Facebook brand" = "Messages";

"Messenger|The title of the app, used in Appirater's dialog." = "Messenger";

"More Friends (%d)|Title for chat bar section containing friends who are not top friends. Number after string is number of friends who are online or pushable." = "More Friends (%1$d)";

"More Friends (%d)|Title for chat bar section containing online friends who are not top friends. Number after string is number of friends who are online." = "More Friends (%1$d)";

"More Online Friends|Table title: More friends who are online (but are not top ranked friends)" = "More Online Friends";

"NOTE: People you add will see all previous messages in this conversation.|warning when adding new people to a thread" = "NOTE: People you add will see all previous messages in this conversation.";

"Name is Too Long|alert title for long conversation name" = "Name is Too Long";

"Name|Placeholder text: Name of new contact" = "Name";

"Never miss a message again|Detail subtitle for Push Notification NUX slide" = "Never miss a message again";

"Never miss a message from your friends again.|Body of Messenger NUX page 2" = "Never miss a message from your friends again.";

"New Contact|Button title: Create a new contact" = "New Contact";

"New Message|Title of screen shown when user is composing a new message" = "New Message";

"New version available|Title of alert displayed when new version is available" = "New version available";

"Next|Generic button to move to next item" = "Next";

"Next|button label for moving to the next screen" = "Next";

"No Message|dialog title for when user tries to send an empty message" = "No Message";

"No Recipients|dialog title for when user tries to send to no recipients" = "No Recipients";

"No Results|Accessibility label describing a contacts search result with no results" = "No Results";

"No locations shared recently.|message on map view when no location has been shared recently" = "No locations shared recently.";

"No response.|Error reported when no response is received from the server" = "No response.";

"No, Thanks|Label on button for user to decline to rate the app" = "No, Thanks";

"Nobody will see exactly where you are.|Explanation to let user know sharing location will not expose his exact location." = "Nobody will see exactly where you are.";

"Not Now|Button text to temporarily ignore the installation message" = "Not Now";

"Not Now|Not now alert popup button" = "Not Now";

"Not Now|Title of button to not share location for now." = "Not Now";

"Not Now|button label for deferring enabling push notifications" = "Not Now";

"Not now|Button title to decline an upgrade" = "Not now";

"Notifications for This Conversation|Title for per-thread notification settings" = "Notifications for This Conversation";

"Notifications for this conversation are off.|Mute warning display on conversation view" = "Notifications for this conversation are off.";

"Notifications|Label for enabling/disabling notification" = "Notifications";

"OK|Title for generic OK button." = "OK";

"Off Until %@|Short string for indicating that alerts are off until X time" = "Off Until %1$@";

"Off for 1 Hour|Short string for indicating that alerts are off for 1 hour" = "Off for 1 Hour";

"Off|Short string for indicating that alerts are off" = "Off";

"On|Short string for indicating that alerts are on" = "On";

"Open in Maps|action sheet option for opening an address in the Maps app" = "Open in Maps";

"Password|password field placeholder on login screen" = "Password";

"People in this conversation can see your location on the map.|Text of location NUX when user has enabled location services." = "People in this conversation can see your location on the map.";

"People|Section title for list of thread participants." = "People";

"People|title of people tab" = "People";

"Phone Number|placeholder text for phone number field" = "Phone Number";

"Phone or Email|Placeholder text: Phone or email address of new contact" = "Phone or Email";

"Pin friends you message most|Label when users have no favorites" = "Pin friends you message most";

"Please check your confirmation code and try again.|alert message for incorrect confirmation code" = "Please check your confirmation code and try again.";

"Please check your network connection and try again.|" = "Please check your network connection and try again.";

"Please check your number and try again.|Error reported when an invalid phone number response is received from the server" = "Please check your number and try again.";

"Please check your number and try again.|alert message for invalid phone number" = "Please check your number and try again.";

"Please download the latest version of Facebook Messenger.|Notification displayed to user when a version upgrade is available" = "Please download the latest version of Facebook Messenger.";

"Please enter a message or attach a photo|dialog message for when user tries to send an empty message" = "Please enter a message or attach a photo";

"Please enter a phone number or email.|Alert message: Newly created contact has invalid information" = "Please enter a phone number or email.";

"Please enter a valid country code.|alert message for invalid country code" = "Please enter a valid country code.";

"Please enter the email and password you use to log in to Facebook.|Invalid login alert message" = "Please enter the email and password you use to log in to Facebook.";

"Please enter the person's name and contact information.|Alert message: Newly created contact needs more information" = "Please enter the person's name and contact information.";

"Please include a description of your problem.|Message for empty feedback warning." = "Please include a description of your problem.";

"Please rate the quality of your call|Prompt for call quality survey" = "Please rate the quality of your call";

"Please re-login to renew your session.|Error message for expired session" = "Please re-login to renew your session.";

"Please use a shorter conversation name.|alert message for long conversation name" = "Please use a shorter conversation name.";

"Preview|title for image preview screen" = "Preview";

"Privacy & Terms|text for privacy and terms button" = "Privacy & Terms";

"Pull down to refresh...|message for pull down to refresh" = "Pull down to refresh...";

"Push notification alerts are off.|Reminder text for when push alerts are off on the phone." = "Push notification alerts are off.";

"Push notification sounds are off.|Reminder text for when push notification sounds are off on the phone." = "Push notification sounds are off.";

"Push notifications are off.|Reminder text for when push notifications are off on the phone." = "Push notifications are off.";

"Push up to refresh...|message for push up to refresh" = "Push up to refresh...";

"REC|The record button" = "REC";

"Rate %@|Alert title for asking user to rate this app." = "Rate %1$@";

"Rate %@|Label on button prompting user to rate the app." = "Rate %1$@";

"Reach friends wherever they are now — mobile or web.|Body of Messenger NUX page 1" = "Reach friends wherever they are now — mobile or web.";

"Reach friends wherever they are now|Detail subtitle for Cross Platform NUX slide" = "Reach friends wherever they are now";

"Record Audio|action sheet option for recording some audio" = "Record Audio";

"Record Video|action sheet option for recording a video" = "Record Video";

"Record Voice|Button label for attaching an audio clip" = "Record Voice";

"Record|Record button for voice message" = "Record";

"Record|Record button for voice recording" = "Record";

"Recorder failed to start|Error info for users saying the audio recorder failed to start." = "Recorder failed to start";

"Recording cancelled|Notify user that the recording has been successfully cancelled." = "Recording cancelled";

"Release to cancel recording|The instruction to user: release the record button to cancel the recording." = "Release to cancel recording";

"Release to refresh...|message for releasing to refresh" = "Release to refresh...";

"Remind Me Later|Label on button allowing the user to postpone rating the app." = "Remind Me Later";

"Remove Attachment|action sheet option for removing current attachment" = "Remove Attachment";

"Remove Photo|action sheet option for removing chosen photo" = "Remove Photo";

"Remove Photo|action sheet option for removing current attachment" = "Remove Photo";

"Removing...|text for removing progress" = "Removing...";

"Report a Problem|title for give feedback or report bug" = "Report a Problem";

"Resend|Resend - Resend Button Title" = "Resend";

"Retry|generic retry button" = "Retry";

"Save Photo|action sheet option to save photo to library" = "Save Photo";

"Save photo as conversation image?|" = "Save photo as conversation image?";

"Save|" = "Save";

"Saving...|Progress text shown while saving a new image for a thread" = "Saving...";

"Saving...|Progress text shown while saving a new name for a thread" = "Saving...";

"Search for Friends|Accessibility label for button that toggles display of friends list/search" = "Search for Friends";

"Search for More Friends…|Label at bottom of online friends list that lets user search for more friends" = "Search for More Friends…";

"Search to add favorites|placeholder in edit favorites search bar" = "Search to add favorites";

"Search|placeholder in search bar" = "Search";

"Searching...|Placeholder text in a search results list that indicates a contact search is ongoing" = "Searching...";

"See which friends are within walking distance or visiting your city, and let them know you're nearby.|Description of NUX to encourage user to share location." = "See which friends are within walking distance or visiting your city, and let them know you're nearby.";

"Seen by Everyone|Seen state text for when everyone has seen the message." = "Seen by Everyone";

"Seen by everyone|Seen state text for when everyone has seen the message." = "Seen by everyone";

"Seen by %@ %@|Text for when a message has been seen by 1 person at a certain time or date/time. eg. (Seen by <name> <time>)" = "Seen by %1$@ %2$@";

"Seen by %@|Text for when a message has been seen by 1 person" = "Seen by %1$@";

"Seen by %@|Text for when a message has been seen by more than 1 person" = "Seen by %1$@";

"Seen by:|Text for seen state header" = "Seen by:";

"Seen %@ near %@|Text for when a message has been sen at a certain time (or date/time) and location e.g. (Seen 3:33 PM near Palo Alto)" = "Seen %1$@ near %2$@";

"Seen %@|Text for when a message has been seen at a certain time or date/time. eg. (Seen 3:33PM) or (Seen Mon 3:33PM)" = "Seen %1$@";

"Select country code|select country code text" = "Select country code";

"Send to Phone, Chat and Web|Call to action for Cross Platform NUX slide" = "Send to Phone, Chat and Web";

"Send|Nav bar send button text" = "Send";

"Send|Send button for voice message" = "Send";

"Send|text to show in the send button" = "Send";

"Sending...|sending progress text" = "Sending...";

"Sent a message|default notification text for messages with no body text" = "Sent a message";

"Sent from Messenger|indicator that a message was sent from Messenger" = "Sent from Messenger";

"Sent from email|indicator that a message was sent from email" = "Sent from email";

"Sent from mobile|indicator that a message was sent sent from a mobile device" = "Sent from mobile";

"Sent from web|indicator that a message was sent sent from web or chat" = "Sent from web";

"Sent from %@|Text used for showing the location where a message was sent from. e.g (city) or (city, state) or (city, country)." = "Sent from %1$@";

"Session Expired|Error title for expired session" = "Session Expired";

"Settings App > General > Location Services|Location of Location Services Settings page for before 4.3." = "Settings App > General > Location Services";

"Settings App > Location Services|Location of Location Services Settings page for 4.3 or later." = "Settings App > Location Services";

"Settings App > Privacy > Location Services|Location of Location Services Settings page for 6.0 or later." = "Settings App > Privacy > Location Services";

"Settings|Settings alert popup button" = "Settings";

"Settings|title for settings page" = "Settings";

"Settings|title of settings tab" = "Settings";

"Share|Share button title" = "Share";

"Shared a link|text for a link share" = "Shared a link";

"Shared a photo|text for a photo share" = "Shared a photo";

"Shared a video|text for a video share" = "Shared a video";

"Sign Up for Facebook|Sign Up - Sign Up Button Title" = "Sign Up for Facebook";

"Skip|Skip - Skip Button Title" = "Skip";

"Something went wrong. Want to try again?|retry dialog message" = "Something went wrong. Want to try again?";

"Sorry, something went wrong|Generic error message for Web browser errors" = "Sorry, something went wrong";

"Start Group Chats|Call to action for Group Chat NUX slide" = "Start Group Chats";

"Stop attaching media|Accessibility text for button that lets user stop attaching photos or other media, as well as emoticons and emoji" = "Stop attaching media";

"Stop|Stop button for voice recording" = "Stop";

"Submit|Submit button title" = "Submit";

"Switch Account|text for switching logged in user" = "Switch Account";

"Switch to Wi-Fi to complete your call|Error case when calls not allowed over cellular data. Suggest user switch to WiFi instead." = "Switch to Wi-Fi to complete your call";

"Take Photo|action sheet option for taking a photo" = "Take Photo";

"Tap \"Try Again\" to send this message.|prompt for how to resend a failed message send" = "Tap \"Try Again\" to send this message.";

"Tap gear to turn on chat|placeholder in search bar when offline" = "Tap gear to turn on chat";

"Tap to discover who's in the area|Message of in-app notification explaining that user can tap to learn more about sharing location." = "Tap to discover who's in the area";

"Tap to return to call|Message shown on in-call bar explaining that the user may tap on it to return to the call screen" = "Tap to return to call";

"Tap to send a message|Message of in-app notification explaining that user can tap to message to nearby friends." = "Tap to send a message";

"Tap to turn on location|Title of location NUX when user has disabled location services." = "Tap to turn on location";

"Text messages can't be sent to that number.|Error reported when a phone number with an unsupported mobile carrier is on the recipients list of a message." = "Text messages can't be sent to that number.";

"Text your friends wherever they are - on their phones or on chat.|The description message to promote users for installing Facebook Messenger app" = "Text your friends wherever they are - on their phones or on chat.";

"That phone number is not allowed to receive text messages.|Error reported when an unlaunched phone number is on the recipients list of a message." = "That phone number is not allowed to receive text messages.";

"There was a problem connecting to Facebook. Please check your connection and try again.|error message for failing to connect to Facebook" = "There was a problem connecting to Facebook. Please check your connection and try again.";

"There was a problem connecting your call. Please connect to Wi-Fi and try again.|Alert body message when connection failed suggesting user switch to wifi" = "There was a problem connecting your call. Please connect to Wi-Fi and try again.";

"This Conversation|header text for alert settings applying to a single conversation" = "This Conversation";

"Timeline|Button text to go to a user's timeline" = "Timeline";

"Timeline|divebar timeline button title" = "Timeline";

"Tip: Never Miss a Message|Title for reminder to turn on push notifications" = "Tip: Never Miss a Message";

"To accept calls, you need to update to the new version of Messenger.|Error dialog body shown when an incoming call failed because the current version is outdated" = "To accept calls, you need to update to the new version of Messenger.";

"To complete your phone number activation, please enter the activation code|" = "To complete your phone number activation, please enter the activation code";

"To include location with your messages, go to your %@.|Alert dialog instructing the user how to re-enable location permission. The variable is 'Settings App > Location Services' or 'Settings App > General > Location Services'" = "To include location with your messages, go to your %1$@.";

"To make calls, you need to update to the new version of Messenger.|Error dialog body. Shown when a user attempts to make a VoIP call but their version is incompatible." = "To make calls, you need to update to the new version of Messenger.";

"To turn off alerts for this conversation, go to conversation settings.|User education for how to configure conversation alerts" = "To turn off alerts for this conversation, go to conversation settings.";

"To turn off location for all your conversations, go to your %@.|Text of location NUX when user turns off location services for the first time. The parameter is the location of the Location Services in the Settings app (ie. Settings App > Location Services)" = "To turn off location for all your conversations, go to your %1$@.";

"To turn on notifications, visit iPhone Settings %@ Notifications %@ Messenger|Body of dialog telling the user how to enable push notifications" = "To turn on notifications, visit iPhone Settings %1$@ Notifications %2$@ Messenger";

"To use this feature, go to your %@ settings and choose Location Services. Select ON for Facebook.|Error explanation when location services are unavailable. {name1} is the name of the current device, e.g. iPhone." = "To use this feature, go to your %1$@ settings and choose Location Services. Select ON for Facebook.";

"To use this feature, go to your %@ settings and tap Privacy, then Location Services. Select ON for Facebook.|Error explanation when location services are unavailable. {name1} is the name of the current device, e.g. iPhone." = "To use this feature, go to your %1$@ settings and tap Privacy, then Location Services. Select ON for Facebook.";

"To|Accessibility label for to field in contact picker" = "To";

"To:|to field in contact picker" = "To:";

"Touch and hold to talk.\nRelease to send, or slide off the button to cancel.|Instruction text for holding voice record button, letting go to send, and dragging finger off to cancel message" = "Touch and hold to talk.\nRelease to send, or slide off the button to cancel.";

"Try Again|button text for resending an unsent message. this is referred to in the prompt Tap \"Try Again\" text" = "Try Again";

"Turn Off Chat|Button title to let the user change their chat status from online to offline" = "Turn Off Chat";

"Turn Off Until 8am|Option to turn off alerts until 8am" = "Turn Off Until 8am";

"Turn Off for 1h|Option to turn off alerts for 1 hour" = "Turn Off for 1h";

"Turn Off|Option to turn off alerts" = "Turn Off";

"Turn On Chat|Button title to let the user change their chat status from offline to online" = "Turn On Chat";

"Turn On Location Services|Error message title when location services are unavailable." = "Turn On Location Services";

"Turn On Notifications|Call to action in NUX encouraging user to turn on push notifications" = "Turn On Notifications";

"Turn On Notifications|Title of dialog telling the user how to enable push notifications" = "Turn On Notifications";

"Turn On|Option to turn on alerts" = "Turn On";

"Turn On|Turn on alerts" = "Turn On";

"Turn On|button label for deferring enabling push notifications" = "Turn On";

"Turn on Push Notifications|Call to action for Push Notification NUX slide" = "Turn on Push Notifications";

"Turn on push notifications to find out when new messages arrive.|Message for reminder to turn on push notifications" = "Turn on push notifications to find out when new messages arrive.";

"Typing…|Text for when the other user is typing. Ends with an ellipsis (U+2026) and is lower-case." = "Typing…";

"Unable to Call %@|Error dialog title. Shown when app must be updated" = "Unable to Call %1$@";

"Unable to Play Voice Message|The message to show when user receives a voice message but his app doesn't support playing it back." = "Unable to Play Voice Message";

"Unable to Save Image|retry dialog title for setting thread image" = "Unable to Save Image";

"Unable to Send|Title for send feedback failed warning." = "Unable to Send";

"Unable to add more people to the conversation. Please try again.|error message for failing to add people" = "Unable to add more people to the conversation. Please try again.";

"Unable to name your conversation.|error message after setting conversation name" = "Unable to name your conversation.";

"Unable to remove you right now.|error messages after leaving conversation" = "Unable to remove you right now.";

"Unable to save messaging favorites to Facebook|error message for failing to save messaging favorites" = "Unable to save messaging favorites to Facebook";

"Unable to send message. Retry?|Alert text for when a message failed to send that also asks user to retry." = "Unable to send message. Retry?";

"Unable to send message.|Alert text for when a message failed to send." = "Unable to send message.";

"Unable to send right now.|error message for failing to send message" = "Unable to send right now.";

"Unpin|button title to remove user from favorites" = "Unpin";

"Update|Get new version now button." = "Update";

"Updating...|updating progress text" = "Updating...";

"Upgrade Now|button text on alert dialog prompting user to upgrade app" = "Upgrade Now";

"Use|use nav bar button in photo preview screen" = "Use";

"View Call|Text show on button that views an incoming call" = "View Call";

"View in Maps|action sheet option for viewing a map" = "View in Maps";

"View|Alert button that takes user to the thread where a message failed to send" = "View";

"We'll text you a link to confirm your number.|Confirmation information text" = "We'll text you a link to confirm your number.";

"Welcome to Messenger|Title for NUX page" = "Welcome to Messenger";

"Who would you like to send this message to?|dialog message for when user tries to send message to no recipients" = "Who would you like to send this message to?";

"You can control this in your privacy settings.|Explanation to let user know he can change settings of sharing location." = "You can control this in your privacy settings.";

"You will get an SMS or email shortly with a code to use for logging in.|message in login approval dialog" = "You will get an SMS or email shortly with a code to use for logging in.";

"You won't find out when you've received a message.|Body of dialog encouraging the user to enable push notifications" = "You won't find out when you've received a message.";

"Your carrier doesn't allow calling with Messenger. Please turn on Wi-Fi in your phone settings.|Error message when user tries to initiate a call if carrier doesn't allowVOIP and not on wifi" = "Your carrier doesn't allow calling with Messenger. Please turn on Wi-Fi in your phone settings.";

"Your message was not sent.|text shown when a message failed to send" = "Your message was not sent.";

"Your messages were not sent.|text shown when more than 1 message failed to send" = "Your messages were not sent.";

"…|Ellipsis (U+2026) used to represent a chat message that is currently being written" = "…";

"active 1d ago|indicator that a user was active 1 day ago" = "active 1d ago";

"active 1h ago|indicator that a user was active 1 hour ago" = "active 1h ago";

"active 1m ago|indicator that a user was active 1 minute ago" = "active 1m ago";

"active now|indicator that a user is currently active, on web or mobile" = "active now";

"active on mobile %@ ago|presences status for being active on mobile a relative time ago" = "active on mobile %1$@ ago";

"active on mobile|presences status for being active on mobile" = "active on mobile";

"active %id ago|indicator that a user was active 2+ days ago" = "active %1$id ago";

"active %ih ago|indicator that a user was active 2+ hours ago" = "active %1$ih ago";

"active %im ago|indicator that a user was active 2+ minute ago" = "active %1$im ago";

"active %@ ago|presences status for being active a relative time ago" = "active %1$@ ago";

"error|A short message for audio play error" = "error";

"is calling|text below the caller's name when they are calling" = "is calling";

"is typing…|text for when the other user is typing. ends with an ellipsis (U+2026) and is lower-case. name appears on left" = "is typing…";

"on mobile|presences status for being available on mobile" = "on mobile";

"online %@ ago|presences status for being online on the web a relative time ago" = "online %1$@ ago";

"online|presences status for being online on the web" = "online";

"typing…|text for when the other user is typing. ends with an ellipsis (U+2026) and is lower-case." = "typing…";

"%d of %d|Title on photo viewer screen showing which photo is currently displayed. eg. 2 of 3" = "%1$d of %2$d";

"%i Friend of Friends|Number of friends of friends in search result (singular)" = "%1$i Friend of Friends";

"%i Friend|Number of friends in search result (singular)" = "%1$i Friend";

"%i Friends of Friends|Number of friends of friends in search result (plural)" = "%1$i Friends of Friends";

"%i Friends|Number of friends in search result (plural)" = "%1$i Friends";

"%i days|text to show user was online/active N days ago (don't abbrev)" = "%1$i days";

"%i hours|text to show user was online/active N hours ago (don't abbrev)" = "%1$i hours";

"%i minutes|text to show user was online/active N minutes ago (don't abbrev)" = "%1$i minutes";

"%id|short indicator that a user was active 2+ days ago" = "%1$id";

"%ih|short indicator that a user was active 2+ hours ago" = "%1$ih";

"%im|short indicator that a user was active 2+ minute ago" = "%1$im";

"%@  •  %@|Seen state text for a user in a group detail page. eg. (name <bullet-character> time)" = "%1$@  •  %2$@";

"%@ and %@ use Facebook Messenger|Upsell message for promoting Facebook Messenger. It shows how many your friends are already using Messenger" = "%1$@ and %2$@ use Facebook Messenger";

"%@ are Nearby|Title of in-app notification showing some friends are nearby. E.g. Tom, Jerry, +2 are Nearby" = "%1$@ are Nearby";

"%@ is Nearby|Title of in-app notification showing some friend is nearby. E.g. Tom is Nearby" = "%1$@ is Nearby";

"%@ is calling|Message notifying of an incoming call. First parameter is the name of the caller" = "%1$@ is calling";

"%@ is in another call|End call message notifying caller that callee is unavailable. First parameter is the name of the callee" = "%1$@ is in another call";

"%@ is not available|End call message notifying caller that callee is unavailable. First parameter is the name of the callee" = "%1$@ is not available";

"%@ is typing…|string format text for when the other user is typing. ends with an ellipsis (U+2026) and is lower-case. name appears on left" = "%1$@ is typing…";

"%@ tried to call you|Error dialog title shown when an incoming voice call can't be received" = "%1$@ tried to call you";

"%@ uses Facebook Messenger|Upsell message for promoting Facebook Messenger. It shows how many your friends are already using Messenger" = "%1$@ uses Facebook Messenger";

"%@|Name of a person (used both standalone and in lists). Add honorifics (-san, etc.) if appropriate." = "%1$@";

"%@, %i more|List of user names and X more if the list is truncated at N names." = "%1$@, %2$i more";

"%@, %@ and %@ use Facebook Messenger|Upsell message for promoting Facebook Messenger. It shows how many your friends are already using Messenger" = "%1$@, %2$@ and %3$@ use Facebook Messenger";

"%@, %@, %@ and 1 other friend use Messenger|Upsell message for promoting Facebook Messenger. It shows how many your friends are already using Messenger" = "%1$@, %2$@, %3$@ and 1 other friend use Messenger";

"%@, %@, %@ and %i other friends use Messenger|Upsell message for promoting Facebook Messenger. It shows how many your friends are already using Messenger" = "%1$@, %2$@, %3$@ and %4$i other friends use Messenger";

"%@…|a string that has been shortened adding ellipsis (unicode 2026)" = "%1$@…";

"%u Friend is Nearby|Title of in-app notification showing some friend is nearby. E.g. 1 Friend is Nearby" = "%1$u Friend is Nearby";

"%u Friends are Nearby|Title of in-app notification showing some friends are nearby. E.g. 2 Friends are Nearby" = "%1$u Friends are Nearby";

"%u Friends are Nearby|Title of megaphone to encourage user to share location. E.g. 2 Friends are Nearby." = "%1$u Friends are Nearby";

"%u of your friends are sharing when they're nearby|Message to let user know how many of his friends are sharing location." = "%1$u of your friends are sharing when they're nearby";

"%u photo attached|Accessiblity text for a single photo" = "%1$u photo attached";

"%u photos attached|Accessibility text for a photo set" = "%1$u photos attached";

